bdd/06_diseno_relacional.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-08 Fri 15:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diseno Relacional I</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/nostyle"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.10.0/dist/katex.min.css" integrity="sha384-9eLZqc9ds8eNjO3TmqPeYcDj8n+Qfa4nuSiGYa6DjLNcv9BtN69ZIulL9+8CqC9Y" crossorigin="anonymous"/>
</head>
<body>
<div id="content">
<div id="outline-container-org1d1f42f" class="outline-2">
<h2 id="org1d1f42f">Introducción</h2>
<div class="outline-text-2" id="text-org1d1f42f">
<p>
Criterios de un buen diseño relacional
</p>
<ul class="org-ul">
<li>Preservación de información</li>
<li>Redundancia mínima</li>
</ul>

<p>
Cuando se parte de un correcto diseño conceptual y se hace un
correcto pasaje al modelo lógico, se obtiene un esquema sin
redundancia y se preserva toda la información del mundo real que
se quería modelar.
</p>

<p>
Pero, ¿cómo verificamos un esquema relacional? ¿cómo
corregimos un esquema que fue mal diseñado?
</p>

<p>
La teoría del diseño relacional formaliza estos requisitos a través
de las formas normales.
</p>
</div>
</div>
<div id="outline-container-org6f81cf4" class="outline-2">
<h2 id="org6f81cf4">Dependencias funcionales</h2>
<div class="outline-text-2" id="text-org6f81cf4">
</div>
<div id="outline-container-org9ca0381" class="outline-3">
<h3 id="org9ca0381">Definición</h3>
<div class="outline-text-3" id="text-org9ca0381">
<p>
Dada una relación R, una dependencia funcional X → Y , con X , Y ⊂ R es una
restricción sobre las posibles tuplas de R que implica que dos tuplas con igual
valor del conjunto de atributos X deben también tener igual valor del conjunto
de atributos Y .
</p>

<p>
Ésto es:
\[\forall s, t \in \mathbb{R}: s[X] \rightarrow s[Y] = t[Y]\]
</p>

<p>
La dependencia funcional X → Y implica que hay una relación
funcional entre los valores de X y los de Y dentro de la base de
datos.
</p>

<p>
Las dependencias funcionales se definen a partir de la semántica
de los datos. ¡No es posible inferirlas viendo los datos!
</p>
</div>
</div>
</div>
<div id="outline-container-orga133ec9" class="outline-2">
<h2 id="orga133ec9">Formas normales: 1FN, 2FN, 3FN, FNBC</h2>
<div class="outline-text-2" id="text-orga133ec9">
<p>
Las formas normales son una serie de estructuras con las que un esquema de base
de datos puede cumplir ó no.
</p>

<p>
Las formas normales clásicas son:
</p>
<ul class="org-ul">
<li>Primera forma normal (1FN) (E. Codd, 1970)</li>
<li>Segunda forma normal (2FN) (E. Codd, 1971)</li>
<li>Tercera forma normal (3FN) (E. Codd, 1971)</li>
<li>Forma normal Boyce-Codd (FNBC) (R. Boyce E. Codd, 1974)</li>
<li>Cuarta forma normal (4FN) (R. Fagin, 1977)</li>
<li>Quinta forma normal (5FN) (R. Fagin, 1979)</li>
</ul>

<p>
Cada forma normal es más fuerte que las anteriores –en el orden
en que las hemos introducido–. Entonces:
\[S \text{ está en } 5FN \rightarrow S \text{ está en } 4 FN \rightarrow \dots S
\text{ está en } 2FN \rightarrow S \text{ está en } 1FN\]
</p>

<p>
En 1972 E. Codd propuso el concepto de normalización como el
proceso a través del cual se convierte un esquema de base de
datos en uno equivalente (i.e., que preserva toda la
información) y que cumple con una determinada forma normal.
</p>

<p>
El objetivo es:
</p>
<ul class="org-ul">
<li>Preservar la información</li>
<li>Eliminar la redundancia</li>
<li>Evitar las anomalías de ABM</li>
</ul>

<p>
Partiremos de un conjunto de dependencias funcionales que
supondremos definido por el diseñador de la base de datos.
</p>
</div>

<div id="outline-container-org305fee3" class="outline-3">
<h3 id="org305fee3">Primera forma normal (1FN)</h3>
<div class="outline-text-3" id="text-org305fee3">
</div>
<div id="outline-container-org50af697" class="outline-4">
<h4 id="org50af697">Definición</h4>
<div class="outline-text-4" id="text-org50af697">
<p>
Decimos que un esquema de base de datos relacional está en
primera forma normal (1FN) cuando los dominios de todos sus
atributos sólo permiten valores atómicos (es decir, indivisibles) y
monovaluados.
</p>

<p>
Actualmente, se considera que en el modelo relacional todos los
atributos deben ser monovaluados y atómicos.
</p>

<p>
Con este criterio, todo esquema relacional está ya en 1FN.
</p>

<p>
Pero, ¿cómo lo resolveríamos si éste no fuera el caso?
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">{jgomez@udbc.com.ar, jgomez94@mibase.com}</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">{rcasas@udbc.com.ar, rcasas@ggmail.com}</td>
</tr>

<tr>
<td class="org-left">Irene Adler</td>
<td class="org-left">{iadler@udbc.com.ar}</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf098636" class="outline-4">
<h4 id="orgf098636">Situación</h4>
<div class="outline-text-4" id="text-orgf098636">
<p>
Situación:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">{jgomez@udbc.com.ar, jgomez94@mibase.com}</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">{rcasas@udbc.com.ar, rcasas@ggmail.com}</td>
</tr>

<tr>
<td class="org-left">Irene Adler</td>
<td class="org-left">{iadler@udbc.com.ar}</td>
</tr>
</tbody>
</table>

<p>
Solución 1:
</p>

<p>
Colocar un mail por tupla y repetir el nombre del profesor.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">jgomez@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">rcasas@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Irene Adler</td>
<td class="org-left">iadler@udbc.com.ar</td>
</tr>
</tbody>
</table>



<p>
Situación:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">{jgomez@udbc.com.ar, jgomez94@mibase.com}</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">{rcasas@udbc.com.ar, rcasas@ggmail.com}</td>
</tr>

<tr>
<td class="org-left">Irene Adler</td>
<td class="org-left">{iadler@udbc.com.ar}</td>
</tr>
</tbody>
</table>

<p>
Solución 2:
</p>

<p>
Suponer un máximo posible M de mails y tener M atributos
distintos reservados a tal fin. Para profesores que tienen menos
de M mails, quedarán valores nulos.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">mail1</td>
<td class="org-left">mail2</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">jgomez@udbc.com.ar</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">rcasas@udbc.com.ar</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Irene Adler</td>
<td class="org-left">iadler@udbc.com.ar</td>
<td class="org-left">NULL</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org503a629" class="outline-4">
<h4 id="org503a629">Normalización</h4>
<div class="outline-text-4" id="text-org503a629">
<p>
Supongamos ahora un ejemplo algo más complejo:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>dpto</sub></td>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">asignatura</td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
<td class="org-left">{jgomez@udbc.com.ar, jgomez94@mibase.com}</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
<td class="org-left">{rcasas@udbc.com.ar, rcasas@ggmail.com}</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
<td class="org-left">{jgomez@udbc.com.ar, jgomez94@mibase.com}</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
<td class="org-left">{rcasas@udbc.com.ar, rcasas@ggmail.com}</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Irene Adler</td>
<td class="org-left">Álgebra I</td>
<td class="org-left">{iadler@udbc.com.ar}</td>
</tr>
</tbody>
</table>

<p>
Forma 1
</p>

<p>
Identificamos la clave de la relación y movemos el atributo multivaluado a una
nueva relación junto con la clave. El atributo pasa a ser parte de la clave en
la nueva relación.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>dpto</sub></td>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">asignatura</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Irene Adler</td>
<td class="org-left">Álgebra I</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">asignatura</td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
<td class="org-left">jgomez@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
<td class="org-left">rcasas@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
<td class="org-left">jgomez@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
<td class="org-left">rcasas@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Irene Adler</td>
<td class="org-left">Álgebra I</td>
<td class="org-left">iadler@udbc.com.ar</td>
</tr>
</tbody>
</table>

<p>
Forma 2
</p>

<p>
Generamos una tupla distinta por cada valor del atributo multivaluado en cada
tupla.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>dpto</sub></td>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">asignatura</td>
<td class="org-left">mail</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
<td class="org-left">jgomez@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
<td class="org-left">rcasas@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
<td class="org-left">jgomez@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
<td class="org-left">rcasas@udbc.com.ar</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Irene Adler</td>
<td class="org-left">Álgebra I</td>
<td class="org-left">iadler@udbc.com.ar</td>
</tr>
</tbody>
</table>

<p>
Defecto: Genera más información redundante.
</p>

<p>
Forma 3
</p>

<p>
Si establecemos una cantidad máxima de valores, podemos generar un atributo
distinto para cada posible valor. En algunas tuplas, algunos de los atributos
quedarán en NULL.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre<sub>dpto</sub></td>
<td class="org-left">nombre<sub>profesor</sub></td>
<td class="org-left">asignatura</td>
<td class="org-left">mail1</td>
<td class="org-left">mail2</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física II</td>
<td class="org-left">jgomez@udbc.com.ar</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Física II</td>
<td class="org-left">rcasas@udbc.com.ar</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Física</td>
<td class="org-left">Juan Gómez</td>
<td class="org-left">Física III</td>
<td class="org-left">jgomez@udbc.com.ar</td>
<td class="org-left">jgomez94@mibase.com</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Roberta Casas</td>
<td class="org-left">Topología</td>
<td class="org-left">rcasas@udbc.com.ar</td>
<td class="org-left">rcasas@ggmail.com</td>
</tr>

<tr>
<td class="org-left">Matemática</td>
<td class="org-left">Irene Adler</td>
<td class="org-left">Álgebra I</td>
<td class="org-left">iadler@udbc.com.ar</td>
<td class="org-left">NULL</td>
</tr>
</tbody>
</table>

<p>
Defectos: Produce una cantidad de valores nulos, y no se adapta a atributos
multivaluados sin límites.
</p>

<p>
**
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org192da95" class="outline-2">
<h2 id="org192da95">Dependencias multivaluadas y 4FN</h2>
</div>
<div id="outline-container-orge7dd320" class="outline-2">
<h2 id="orge7dd320">Dependencias de junta y 5FN</h2>
</div>
<div id="outline-container-org42d329b" class="outline-2">
<h2 id="org42d329b">Bibliografía</h2>
</div>
</div>
<div id="postamble" class="status">
Last update: 2019-11-08 15:45
</div>
</body>
</html>
